app/views/books/index.html.erb

              <% end %>
              <td>コメント数: <%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"