app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @books = Book.all
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "test"], ["body", "テスト"], ["user_id", 1], ["created_at", "2021-06-22 11:35:03.403527"], ["updated_at", "2021-06-22 11:35:03.403527"]]