app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "50d9f89c0924ea8d8b21d0e5005fc0e927db68e3a30befc14c95c08f574a"], ["updated_at", "2021-06-23 04:45:17.235802"], ["id", 1]]